cmsis-svd/cmsis-svd/data/Spansion/MB9BF12xS_svd.xml
        <!-- REGISTER "I2C_FBYTE2" -->
        <register>
          <name>I2C_FBYTE2</name>
          <description> register I2C_FBYTE2 </description>
          <alternateGroup>I2C</alternateGroup>
          <addressOffset>0x19</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "I2C_EIBCR" -->
        <register>
          <name>I2C_EIBCR</name>
          <description> register I2C_EIBCR </description>
          <alternateGroup>I2C</alternateGroup>
          <addressOffset>0x1D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0C</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SDAS" -->
            <field>
              <name>SDAS</name>
              <description> bitfield SDAS </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCLS" -->
            <field>
              <name>SCLS</name>
              <description> bitfield SCLS </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDAC" -->
            <field>
              <name>SDAC</name>
              <description> bitfield SDAC </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCLC" -->
            <field>
              <name>SCLC</name>
              <description> bitfield SCLC </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOCE" -->
            <field>
              <name>SOCE</name>
              <description> bitfield SOCE </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BEC" -->
            <field>
              <name>BEC</name>
              <description> bitfield BEC </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "MFS1" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS1</name>
      <baseAddress>0x40038100</baseAddress>
      <!-- INTERRUPT "MFS1_9_RX" -->
      <interrupt>
        <name>MFS1_9_RX</name>
        <value>9</value>
      </interrupt>
      <!-- INTERRUPT "MFS1_9_TX" -->
      <interrupt>
        <name>MFS1_9_TX</name>
        <value>10</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS2" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS2</name>
      <baseAddress>0x40038200</baseAddress>
      <!-- INTERRUPT "MFS2_10_RX" -->
      <interrupt>
        <name>MFS2_10_RX</name>
        <value>11</value>
      </interrupt>
      <!-- INTERRUPT "MFS2_10_TX" -->
      <interrupt>
        <name>MFS2_10_TX</name>
        <value>12</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS3" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS3</name>
      <baseAddress>0x40038300</baseAddress>
      <!-- INTERRUPT "MFS3_11_RX" -->
      <interrupt>
        <name>MFS3_11_RX</name>
        <value>13</value>
      </interrupt>
      <!-- INTERRUPT "MFS3_11_TX" -->
      <interrupt>
        <name>MFS3_11_TX</name>
        <value>14</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS4" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS4</name>
      <baseAddress>0x40038400</baseAddress>
      <!-- INTERRUPT "MFS4_12_RX" -->
      <interrupt>
        <name>MFS4_12_RX</name>
        <value>15</value>
      </interrupt>
      <!-- INTERRUPT "MFS4_12_TX" -->
      <interrupt>
        <name>MFS4_12_TX</name>
        <value>16</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS5" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS5</name>
      <baseAddress>0x40038500</baseAddress>
      <!-- INTERRUPT "MFS5_13_RX" -->
      <interrupt>
        <name>MFS5_13_RX</name>
        <value>17</value>
      </interrupt>
      <!-- INTERRUPT "MFS5_13_TX" -->
      <interrupt>
        <name>MFS5_13_TX</name>
        <value>18</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS6" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS6</name>
      <baseAddress>0x40038600</baseAddress>
      <!-- INTERRUPT "MFS6_14_RX" -->
      <interrupt>
        <name>MFS6_14_RX</name>
        <value>19</value>
      </interrupt>
      <!-- INTERRUPT "MFS6_14_TX" -->
      <interrupt>
        <name>MFS6_14_TX</name>
        <value>20</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS7" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS7</name>
      <baseAddress>0x40038700</baseAddress>
      <!-- INTERRUPT "MFS7_15_RX" -->
      <interrupt>
        <name>MFS7_15_RX</name>
        <value>21</value>
      </interrupt>
      <!-- INTERRUPT "MFS7_15_TX" -->
      <interrupt>
        <name>MFS7_15_TX</name>
        <value>22</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS8" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS8</name>
      <baseAddress>0x40038800</baseAddress>
      <!-- INTERRUPT "MFS0_8_RX" -->
      <interrupt>
        <name>MFS0_8_RX</name>
        <value>7</value>
      </interrupt>
      <!-- INTERRUPT "MFS0_8_TX" -->
      <interrupt>
        <name>MFS0_8_TX</name>
        <value>8</value>
      </interrupt>
    </peripheral>
