cmsis-svd/cmsis-svd/data/Spansion/MB9BF12xS_svd.xml
        <!-- REGISTER "WTTR" -->
        <register>
          <name>WTTR</name>
          <description> register WTTR </description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TM17" -->
            <field>
              <name>TM17</name>
              <description> bitfield TM17 </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM16" -->
            <field>
              <name>TM16</name>
              <description> bitfield TM16 </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM15" -->
            <field>
              <name>TM15</name>
              <description> bitfield TM15 </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM14" -->
            <field>
              <name>TM14</name>
              <description> bitfield TM14 </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM13" -->
            <field>
              <name>TM13</name>
              <description> bitfield TM13 </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM12" -->
            <field>
              <name>TM12</name>
              <description> bitfield TM12 </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM11" -->
            <field>
              <name>TM11</name>
              <description> bitfield TM11 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM10" -->
            <field>
              <name>TM10</name>
              <description> bitfield TM10 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM9" -->
            <field>
              <name>TM9</name>
              <description> bitfield TM9 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM8" -->
            <field>
              <name>TM8</name>
              <description> bitfield TM8 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM7" -->
            <field>
              <name>TM7</name>
              <description> bitfield TM7 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM6" -->
            <field>
              <name>TM6</name>
              <description> bitfield TM6 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM5" -->
            <field>
              <name>TM5</name>
              <description> bitfield TM5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM4" -->
            <field>
              <name>TM4</name>
              <description> bitfield TM4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM3" -->
            <field>
              <name>TM3</name>
              <description> bitfield TM3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM2" -->
            <field>
              <name>TM2</name>
              <description> bitfield TM2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM1" -->
            <field>
              <name>TM1</name>
              <description> bitfield TM1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM0" -->
            <field>
              <name>TM0</name>
              <description> bitfield TM0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTCLKS" -->
        <register>
          <name>WTCLKS</name>
          <description> register WTCLKS </description>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTCLKS" -->
            <field>
              <name>WTCLKS</name>
              <description> bitfield WTCLKS </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTCLKM" -->
        <register>
          <name>WTCLKM</name>
          <description> register WTCLKM </description>
          <addressOffset>0x21</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTCLKM" -->
            <field>
              <name>WTCLKM</name>
              <description> bitfield WTCLKM </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTCAL" -->
        <register>
          <name>WTCAL</name>
          <description> register WTCAL </description>
          <addressOffset>0x24</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x03FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTCAL" -->
            <field>
              <name>WTCAL</name>
              <description> bitfield WTCAL </description>
              <lsb>0</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTCALEN" -->
        <register>
          <name>WTCALEN</name>
          <description> register WTCALEN </description>
          <addressOffset>0x26</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTCALEN" -->
            <field>
              <name>WTCALEN</name>
              <description> bitfield WTCALEN </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
